---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.NetworkCommunicationException
source: html/230de6ac-6f36-fb9f-b3b2-1dbb6c1b0ffd.htm
---
# NetworkCommunicationException Methods

Retrieves data needed to serialize the target object.